import math

#1. Розробіть і виконайте програмний код в інтерактивному режимі, який виводить на екран два речення:

print("У мові Pyton застосовується байт-код.")

print("Pyton забезпечує високу компактність і наочність програмного коду.")

#2. Складіть програму для обчислення значення виразу 2,3+1,6*4

print ("Результат:", float (1.6 * 4 + 2.3))

#3. Дано два числа. Виконайте їх цілочислове ділення та ділення за модулем (залишок від ділення).

def Division(a, b):

    c = a % b

    print(c)

    
Division(10, 4) 

#4. Виконайте об’єднання рядків слів “опрацю” і “вання”.

a = "опрацю"

b = "вання"

print(a + b)

#5. Складіть найпростіший код перевірки входження рядка “Чемпіонат України” в рядок “Чемпіонат України з футболу”.

First = "Чемпіонат України"

Second = "Чемпіонат України з футболу" 

def Check(a, b):

     if a in b:

        print("Yes")

     else:

        print("No")


Check(First, Second)